using System;
using System.Collections.Generic;
using System.Linq;
using System.Threading.Tasks;

namespace Model.Models.User
{
    /********************************************************************\
    ИНТЕРФЕЙС.: IUserRegistrator
    ОПИСАНИЕ..: Интерфейс классов, регистрирующих новых пользователей
    МЕТОДЫ....: bool tryRegistrate(CRegistrationData data) - регистрирует
                нового пользователя с указанными данными
                bool Handshake() - проверка доступа к месту хранения
                данных о пользователях
    \********************************************************************/
    public interface IUserRegistrator
    {
        /********************************************************************\
        МЕТОД.....: tryRegistrate
        ОПИСАНИЕ..: Регистрирует нового пользователя с указанными данными
        ВОЗВРАЩАЕТ: bool - удалось ли зарегистрировать пользователя
        \********************************************************************/
        bool tryRegistrate(CRegistrationData data);

        /********************************************************************\
        МЕТОД.....: Handshake
        ОПИСАНИЕ..: Проверка доступа к месту хранения данных о пользователях
        ВОЗВРАЩАЕТ: bool - существует ли доступ
        \********************************************************************/
        bool Handshake();
    }
}
