using System;
using System.Collections.Generic;
using System.Linq;
using System.Threading.Tasks;

namespace Model.Models.Testing.Score
{
    /********************************************************************\
    ИНТЕРФЕЙС.: IScoreSummator
    ОПИСАНИЕ..: Интерфейс классов, считающий итоговый балл за блоки
                заданий и тесты.
    ПОЛЯ......: ESummatorID ID - ID вида сумматора баллов
    МЕТОДЫ....: double Calculate(List<double> UserScores, List<long>
                UserTimes, long Time) - вычисляет итоговый балл за
                блок/тест по определённой схеме.
                IScoreSummator Copy() - копирует текущую схему оценки.
    \********************************************************************/
    public interface IScoreSummator
    {
        ESummatorID ID { get; } // ID вида сумматора баллов

        /********************************************************************\
        МЕТОД.....: Calculate
        ОПИСАНИЕ..: Возвращает итоговый балл за блок/тест исходя из
                    набранных пользователем баллов и затраченного и ожидаемого
                    времени.
        ПАРАМЕТРЫ.: List<double> UserScores - набранный пользователем балл.
                    List<long> UserTimes - затраченное пользователем время.
                    long Time - ожидаемое время выполнения.
        ВОЗВРАЩАЕТ: double - итоговый балл при заданных показателях.
        \********************************************************************/
        double Calculate(List<double> UserScores, List<TimeSpan> UserTimes);

        /********************************************************************\
        МЕТОД.....: Copy
        ОПИСАНИЕ..: Создаёт копию текущего способа оценки.
        ВОЗВРАТ...: IScoreSummator - скопированный способ оценки.
        \********************************************************************/
        IScoreSummator Copy();
    }
}
