using System;
using System.Collections.Generic;
using System.Linq;
using System.Threading.Tasks;

namespace Model.Models.User
{
    /********************************************************************\
    ИНТЕРФЕЙС.: IUserFinder
    ОПИСАНИЕ..: Интерфейс классов, читающих данные о пользователях
    МЕТОДЫ....: List<CFindRecord> getAllUser() - возвращает данные о всех
                зарегестрированных пользователей
                CFindRecord findByID(int ID) - возвращает данные о
                пользователе с указанным ID
                CFindRecord findByLogin(string login) - возвращает данные
                о пользователе с указанным логином
    \********************************************************************/
    public interface IUserFinder
    {
        /********************************************************************\
        МЕТОД.....: getAllUser
        ОПИСАНИЕ..: Возвращает данные всех зарегистрированных пользователей
        ВОЗВРАЩАЕТ: List<CFindRecord>  - данные всех пользователей
        \********************************************************************/
        List<CFindRecord> getAllUser();

        /********************************************************************\
        МЕТОД.....: findByID
        ОПИСАНИЕ..: Возвращает данные всех зарегистрированных пользователей
        ПАРАМЕТРЫ.: int ID - ID искомого пользователя
        ВОЗВРАЩАЕТ: CFindRecord - Данные о пользователе с искомым ID
        \********************************************************************/
        CFindRecord findByID(int ID);

        /********************************************************************\
        МЕТОД.....: findByLogin
        ОПИСАНИЕ..: Возвращает данные о пользователе с указанным логином
        ПАРАМЕТРЫ.: string login - искомый логин
        ВОЗВРАЩАЕТ: CFindRecord - данные о пользователе
        \********************************************************************/
        CFindRecord findByLogin(string login);
    }
}
